Tekla.Structures.Analysis.AnalysisPartBarAttributes
The AnalysisPartBarAttributes class contains information related to analysis part bar attributes.

Tekla.Structures.Analysis.AnalysisPartBarAttributes._BarStartCondition
The bar start condition of the analysis part.

Tekla.Structures.Analysis.AnalysisPartBarAttributes._BarEndCondition
The bar end condition of the analysis part.

Tekla.Structures.Analysis.AnalysisPartBarAttributes._ForceStraightSegments
The straight force segments.

Tekla.Structures.Analysis.AnalysisPartBarAttributes._SplitNodeCount
The count of the split node.

Tekla.Structures.Analysis.AnalysisPartBarAttributes._SplitDistances
The split distances.

Tekla.Structures.Analysis.AnalysisPartBarAttributes._BarStartNumber
The bar start number.

Tekla.Structures.Analysis.AnalysisPartBarAttributes._MemberStartNumber
The member start number.

Tekla.Structures.Analysis.AnalysisPartBarAttributes.BarStartCondition
The bar start condition.

Tekla.Structures.Analysis.AnalysisPartBarAttributes.BarEndCondition
The bar end condition.

Tekla.Structures.Analysis.AnalysisPartBarAttributes.OverrideProfileName
The override profile name.
Deprecated since TS2018, use OverrideProfile of analysis part.

Tekla.Structures.Analysis.AnalysisPartBarAttributes.ForceStraightSegments
The straight force segments.

Tekla.Structures.Analysis.AnalysisPartBarAttributes.SplitNodeCount
The count of the split node.

Tekla.Structures.Analysis.AnalysisPartBarAttributes.SplitDistances
The split distances.

Tekla.Structures.Analysis.AnalysisPartBarAttributes.BarStartNumber
The start number of the bar.

Tekla.Structures.Analysis.AnalysisPartBarAttributes.MemberStartNumber
The start number of the member.